app/Controllers/PlanesController.php

SELECT *
FROM `planes`
---
    public function index(): string
    {
        $planes = new PlanesModel();
        $datos['datos']=$planes->findAll();

DELETE FROM `planes`
WHERE `plan_id` IN ('7')
---
    public function eliminarPlan($id=null){
        echo "codigo: ". $id;
        $plan = new PlanesModel();
        $plan->delete(['plan_id'=>$id]);

SELECT *
FROM `planes`
WHERE `plan_id` = '5'
 LIMIT 1
---
    public function buscarPlan($id=null){
        //echo "codigo: ". $id;
        $plan = new PlanesModel();
        $datos['datos']=$plan->where(['plan_id'=>$id])->first();